// 보그 JS 카테고리 페이지 JS - category.js

// 객체로 만들어진 데이터 파일을 별도로 만든것을
// 제이슨(JSON)이라고 한다!
// 제이쿼리에서 제이슨 파일을 불러와서 변수에
// 할당하여 사용할 수 있다!!!
// 제이슨 위치: js/cat.json

// 제이쿼리 제이슨 가져오기 메서드
// $.getJSON(파일경로,함수)
// $.getJSON(파일경로,(변수)=>{코드})
// -> 함수의 변수는 제이슨 파일의 데이터를 전달함!
// 제이슨 파일경로로 불러오고 함수에서 내가 쓸 변수에 
// 할당한다!!!

// 참고) 자바스크립트는 제이슨을 쓰려면  js파일처럼  json도
// html페이지에서 <script src="제이슨파일"> 이렇게 호출함!
// 코드에서 JSON.parse(변수) 제이슨 변환 메서드를 사용해 코딩함!


// 제이슨 데이터 할당변수
let sinfo;
// 제이슨 데이터 연결하여 할당하기!
$.getJSON('js/cat.json', 
jdata =>{ 
    // 제이슨 파일에서 가져온 데이터를 변수에 할당!
    sinfo = jdata;
    // 데이터확인
   console.log(sinfo);
});
// jdata는 함수전달변수임(이름 맘대로!)


// URL로 넘어온 파라미터 전달값 받기 //////


////// 제이쿼리 코드블럭 ///////////////////////
$(()=>{



}); ////////////// jQB ////////////////////////
///////////////////////////////////////////////